Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Lullaby.tmx
Source language: en
Languages: es_419

source: well right now, my priority is to protect this woman so I can to return to the demon world.
es_419: en este momento, mi prioridad es proteger a esta mujer para poder volver al mundo de los demonios.

source: I seriously can’t understand why you did what you did for me today.
es_419: no logro entender por qué arriesgaste tu vida por mí.

source: no. I can’t do that.
es_419: no. no puedo.

source: oh, okay...
es_419: ah, está bien.

source: if I tell him how I feel, he’ll be uncomfortable and unsure about what to do, which would make me feel even worse.
es_419: si le confieso lo que siento, se sentirá incómodo y no sabrá qué hacer. y eso me haría sentir aun peor.

source: what are you talking about right now?
es_419: ¿de qué hablas?

source: if I get to return to the demon world, I'll make sure to compensate you accordingly.
es_419: si logro volver al mundo de los demonios, te compensaré bien.

source: miss seohwa?
es_419: ¿seohwa?

source: Chapter 18 Written by MJ Art by Baeklee
es_419: Episodio 18 Historia: MJ Arte: Baeklee

source: limp
es_419: RENGUEA

source: Chapter 28 Written by MJ Art by Baeklee
es_419: Episodio 28 Historia: MJ Arte: Baeklee

source: an employee discount...?!
es_419: ¡¿descuento para empleados?!

source: I mean...
es_419: quiero decir…

source: I tend not to dwell on tough or complicated problems for too long.
es_419: yo trato de no pensar mucho en problemas o asuntos muy complicados.

source: don't go on your phone before bed since the screen light lowers quality of sleep.
es_419: no uses el celular antes de dormir porque la luz artificial disminuye la calidad del sueño.

source: Chapter 15 Written by MJ Art by Baeklee
es_419: Episodio 15 Historia: MJ Arte: Baeklee

source: empty
es_419: DESOLADO

source: I do have something I want to ask.
es_419: bueno, me gustaría preguntarle algo.

source: I guess not... but you shouldn't have done that while the other employees were watching!!
es_419: supongo que no, pero… ¡¡no tendría que haber hecho eso frente a los demás empleados!!

source: this torturous cycle of punishment that has begun anew each day for centuries...
es_419: este ciclo tormentoso de castigo que se repite una y otra vez desde hace siglos…

source: of course.
es_419: por supuesto.

source: Hello dear readers.
es_419: Hola, queridos lectores.

source: I don’t feel uncomfortable when I’m with you. not at all.
es_419: no me siento incómoda cuando estoy con usted. en absoluto.

source: okay!!
es_419: ¡¡bueno!!

source: y-you're awake!
es_419: ¡s-se despertó!

source: click
es_419: CLIC

source: Chapter 3
es_419: Episodio 3

source: can’t I just have feelings for him... without expecting anything in return? like having a crush on a celebrity...
es_419: ¿no puedo enamorarme de él… sin esperar nada a cambio? como si me gustara una celebridad…

source: I need to find an someone who can run the business after I’m gone...
es_419: necesito a alguien que pueda dirigir la compañía cuando yo me vaya.

source: sensitive monsters.
es_419: monstruos sensibles.

source: my heart keeps pounding, i can’t stop it.
es_419: me late muy fuerte el corazón. no sé cómo detenerlo.

source: Mr. Gam
es_419: señor gam

source: I heard these foods help you fall asleep easily.
es_419: oí que estos alimentos ayudan a dormir bien.

source: haha, something suddenly came up.
es_419: jaja, es que surgió algo hace poco.

source: I’m worried about you.
es_419: estoy preocupado por ti.

source: do you even know who I am?
es_419: ¿tienes idea de quién soy?

source: about me? why?
es_419: ¿yo? ¿qué cosa?

source: Chapter 22 Written by MJ Art by Baeklee
es_419: Episodio 22 Historia: MJ Arte: Baeklee

source: a duty to keep you safe!
es_419: ¡el deber de protegerlo!

source: he's my younger half-brother.
es_419: es mi medio hermano menor.

source: by the way... what were you doing just now...?
es_419: por cierto, ¿qué hacía recién?

source: ...I haven’t forgotten any of it.
es_419: … a ninguna persona ni vivencia.

source: I recently got a job.
es_419: conseguí empleo hace poco.

source: he is the most powerful and beautiful demon. he also controls sleep.
es_419: es el demonio más poderoso y hermoso. además, controla el sueño.

source: clap
es_419: PLAS

source: seohwa's neighborhood
es_419: vecindario de seohwa

source: haha. miss seohwa, about that dinner we talked about—
es_419: ja, ja. seohwa, la cena que estábamos planeando…

source: it looks like you weren't able to sleep at all.
es_419: parece que no pegaste un ojo en toda la noche.

source: how long is this gonna take?
es_419: ¿le faltará mucho?

source: so many top celebrities and wealthy women have approached him, but he never pays attention to any of them.
es_419: muchas celebridades y mujeres adineradas quisieron conquistarlo, pero a él nunca le interesaron.

source: what am I thinking about right now?
es_419: ¿en qué estoy pensando?

source: even if I have to skip meals or lose some sleep over it.
es_419: aunque eso implique comer o dormir menos.

source: for you to make the person I like somehow like me back?
es_419: que haga que la persona que me gusta sienta lo mismo por mí?

source: I can't.
es_419: no puedo.

source: excuse me, who are you talking to?
es_419: disculpa, ¿con quién hablas?

source: why does she look so surprised? did I say something wrong?
es_419: ¿por qué se ve tan sorprendida? ¿dije algo malo?

source: yes. what about that person? what happened to him?
es_419: sí. ¿quién era esa persona? ¿qué le pasó?

source: why is my heart pounding all of the sudden?
es_419: ¿por qué me late tan fuerte el corazón?

source: how much do you need?
es_419: ¿cuánto necesitas?

source: I can't believe...
es_419: no puedo creer…

source: it's huge! this is the multi-storey penthouse that I've only heard about by word of mouth!
es_419: ¡es enorme! ¡el penthouse de varios pisos del que había oído por el boca a boca!

source: is that white poppy gone now?
es_419: ¿ya se fue la amapola blanca?

source: you were the first person in 600 years who was able to see me while I worked through my list,
es_419: fuiste la primera persona en 600 años que pudo verme mientras hacía dormir a la gente de mi lista.

source: why isn’t she saying anything?
es_419: ¿por qué no dice nada?

source: by the way, you dropped this when you were getting off the elevator.
es_419: por cierto, se te cayó esto cuando salías del ascensor.

source: wait, maybe not nothing.
es_419: momento, quizás me equivoque.

source: now, if you'll excuse me.
es_419: si me disculpa, me retiro.

source: they're probably just busy.
es_419: quizá solo estén ocupados.

source: I... like mr. gam? no way!
es_419: ¿me gusta… el señor gam? ¡imposible!

source: huh?!
es_419: ¡¿eh?!

source: SAD
es_419: TRISTE

source: how does she know all that? it’s almost as if she were watching me during those nights.
es_419: ¿cómo sabe todo eso? es como si me hubiera estado observando todas esas noches.

source: it could be a dream or a hallucination.
es_419: podría ser un sueño o una alucinación.

source: I get low blood sugar in the afternoon and it affects my productivity.
es_419: a la tarde tengo bajas de azúcar en sangre, lo que afecta mi productividad.

source: please stop asking me...!!
es_419: ¡¡por favor, basta de preguntas!!

source: I guess it’s true that moving around and exercising helps whenever you’re worrying about something. it stops you from dwelling on it so much.
es_419: supongo que es cierto que moverse y hacer ejercicio ayuda cuando algo te preocupa. te despeja la mente.

source: do humans eat these things? humans really don't ever seem to improve.
es_419: ¿los humanos comen esto? parece que nunca mejoran en nada.

source: stand
es_419: FUIP

source: I’ll look after her, so you should go home... mr. yeonu park.
es_419: yo la cuido, así que puedes irte a casa… yeonu park.

source: is he seriously only visible to me?
es_419: ¿de verdad solo yo lo puedo ver?

source: it doesn’t seem to be the case here.
es_419: este no parece ser el caso.

source: keep this in mind. you need to sleep well, no matter what, if you want this contract to end quickly.
es_419: recuerda que, cuanto mejor duermas, más pronto acabará este contrato.

source: no way... did he realize how I feel about him?
es_419: ¡no puede ser! ¿se habrá dado cuenta de que me gusta?

source: so I was wondering if you also don't have any family here like me...
es_419: me preguntaba si, al igual que yo, no tiene familia aquí.

source: I know. of course you can’t!
es_419: ya sé. ¡claro que no puede!

source: all the employees have exited the building. now...
es_419: todos los empleados ya salieron del edificio. ahora…

source: you don't look very well. how about you take a short break? you've been working very hard and keeping late hours.
es_419: no te ves bien. ¿por qué no descansas un poco? has estado trabajando hasta cualquier hora.

source: I know... but still, we came all the way here...
es_419: ya sé, pero ya que viajamos hasta aquí…

source: I’m not doing this by choice.
es_419: no lo hago por elección.

source: pull yourself together, seohwa lee.
es_419: tranquilízate, seohwa lee.

source: I don't want my precious sleep time to get affected because you're focused on something else.
es_419: no quiero que mis preciadas horas de sueño se vean afectadas porque estás enfocada en otra cosa.

source: ...that rumor... it’s not true, is it?
es_419: … ¿es cierto ese rumor?

source: I also didn't synchronize on purpose!
es_419: ¡además, no me sincronicé a propósito!

source: oh.
es_419: ah.

source: ...mama's gonna buy you a mockingbird.
es_419: arrorró, pedazo, de mi corazón.

source: he has the looks, wealth, and reputation...
es_419: tiene buena pinta y reputación, además de ser rico.

source: oh, I was just going to help because you looked uncomfortable in my jacket.
es_419: ah, te estaba por ayudar porque parecías incómoda con mi chaqueta.

source: do you need anything else?
es_419: ¿necesitas algo más?

source: please, go to a different sauna and--
es_419: por favor, ve a otro sauna y…

source: I stopped myself because I didn’t want to make things awkward for her...
es_419: me contuve porque no quería hacerla pasar vergüenza.

source: I don't think you understand.
es_419: creo que no entiendes.

source: wait, m-mr. gam?!
es_419: momento, ¡¿s-señor gam?!

source: did that bastard do something to it...?
es_419: ¿ese desgraciado le habrá hecho algo?

source: of couse, sleeping well means getting high quality sleep.
es_419: claro que dormir bien implica descansar bien.

source: what the heck?
es_419: ¿pero qué?

source: gns beds make any insomniac fall asleep...
es_419: si los colchones de dne hacen dormir a cualquiera,

source: thank goodness.
es_419: menos mal.

source: has manifested as a deep sorrow.
es_419: se manifestó como una profunda tristeza.

source: Chapter 7
es_419: Episodio 7

source: because I’m someone you need.
es_419: y me necesita. ¿no cree?

source: keep this in mind.
es_419: escúchame.

source: here, take it.
es_419: aquí tiene.

source: I’ll ask mr. geum to drive you home.
es_419: le pediré al señor geum que te lleve a casa.

source: confused
es_419: CONFUNDIDA

source: I'll be back shortly.
es_419: ya vuelvo.

source: oh...! like a marionette!
es_419: ¡ah! ¡como una marioneta!

source: I'm not sure what you're talking about.
es_419: no sé muy bien de qué habla.

source: but now that you mention it, I should add that too.
es_419: pero, ahora que lo mencionas, agregaré eso al contrato.

source: I just had a nightmare.
es_419: tuve una pesadilla.

source: because of what you said while we were in the mountains. you said it was possible that we’re connected because something terrible happened between the two of us in my previous life...
es_419: por lo que me reveló cuando estábamos en las montañas. me dijo que posiblemente estemos conectados por algo terrible que pasó entre nosotros en mi vida pasada.

source: you need to give me your hands.
es_419: deme las manos.

source: really? not even once?
es_419: ¿en serio? ¿ni una vez?

source: um... it feels a little awkward to be lying in bed with someone...
es_419: em… estar acostada en la cama con alguien me hace sentir un poco rara.

source: to be honest, I also had a strange vision once.
es_419: la verdad, yo también tuve una visión extraña.

source: the special cheese sauce made by the owner comes in and gently neutralizes the flavor!!
es_419: la salsa de queso especial que prepara el dueño neutraliza el sabor con sutileza.

source: strange... did something happen?
es_419: qué raro. ¿habrá pasado algo?

source: still, please go back down to the first floor and leave before you get caught, okay?
es_419: aun así, vete de aquí antes de que te atrapen, ¿de acuerdo?

source: it must be here somewhere...
es_419: tiene que estar por aquí…

source: you’re the one who called me and said it was urgent...
es_419: usted fue quien me llamó diciendo que era algo urgente.

source: he's seriously out of his mind...
es_419: monstruo sensible…

source: I too was a pretty scary demon back then!
es_419: ¡yo también era un demonio muy aterrador!

source: I'm now an employee of gns!
es_419: ¡soy oficialmente empleada de dne!

source: the sleep demon’s bedroom
es_419: cuarto del demonio del sueño

source: did I just fall asleep?
es_419: ¿me quedé dormido?

source: taking a warm bath helps with falling asleep quickly.
es_419: tomar un baño relajante facilita el sueño.

source: wait, why am I so annoyed right now? who cares if she laughs or not?
es_419: momento, ¿por qué estoy tan molesto? ¿qué me importa si se ríe o no?

source: please, try to be patient.
es_419: ten paciencia.

source: mr. gam told me to share this with the department and tell everyone to keep up the hard work.
es_419: el señor gam me dijo que compartiera esto con el departamento y les diga que continúen trabajando así.

source: I'm not running a charity here.
es_419: yo no hago caridad.

source: I want to talk to you about something.
es_419: quiero hablarte de algo.

source: hiss
es_419: SHIC

source: seriously...
es_419: en serio…

source: going to the demon world is what matters most to mr. gam,
es_419: lo que más le importa al señor gam es volver al mundo de los demonios,

source: someone... please help me...
es_419: por favor, ayúdenme.

source: you can't just bring me to my house...!
es_419: ¡no puede traerme a mi casa!

source: I’m the one who hurt you...
es_419: yo soy quien te lastimó…

source: I’m going to try my best.
es_419: para no arrepentirme de nada en el futuro.

source: I understand, so take your time. you don't want to get an upset stomach.
es_419: entiendo, así que tómate tu tiempo, no vaya a ser que después te duela el estómago.

source: clutch
es_419: CLIC

source: good morning, mr. gam!
es_419: ¡buenos días, señor gam!

source: I can't hear you, mr. gam. what did you just say?
es_419: no lo oigo, señor gam. ¿qué dijo?

source: I'm gonna get cramps all over my body.
es_419: se me acalambrará todo el cuerpo.

source: ...and you'll go back to the demon world once all the sand in the hourglass reaches the bottom?
es_419: … y volverá al mundo de los demonios una vez que toda la arena haya llegado al fondo del reloj?

source: you're the one.
es_419: mira quién habla.

source: don’t you remember?
es_419: ¿no te acuerdas?

source: you? protect me?
es_419: ¿tú me protegerás a mí?

source: I should change positions.
es_419: debo cambiar de posición.

source: no, it’s not.
es_419: no, no es lo mismo.

source: I feel dizzy and nauseous after teleporting so many times.
es_419: tengo náuseas y estoy mareada por teletransportarnos tantas veces.

source: in what twisted way were you and he connected in your previous life?
es_419: ¿de qué manera retorcida él y tú estaban conectados en tu otra vida?

source: why does my chest ache so much?
es_419: ¿por qué me duele tanto el pecho?

source: I think you're mistaken.
es_419: creo que está confundido.

source: you'll never be able to set foot in this place ever again.
es_419: jamás podrás volver a pisar este lugar.

source: three hours later
es_419: tres horas después

source: you might say that,
es_419: aunque diga eso,

source: why is she sitting over there?
es_419: ¿qué hace sentada ahí?

source: yeri kim associate manager (28)
es_419: yeri kim, gerenta asociada (28)

source: that's probably because...
es_419: quizá sea porque…

source: oh, sorry about that. it’s just that no one’s ever asked me such a question before...
es_419: uy, perdón. es que nunca nadie me había preguntado algo así.

source: ...I don’t want you to end up causing anyone harm.
es_419: … no quiero que nadie salga lastimado por su culpa.

source: although I’ll never be able to confess my feelings to him...
es_419: aunque jamás me animaría a confesarle mis sentimientos…

source: I used to be the king of the demon world, but I was betrayed and fell into the human world.
es_419: antes era el rey del mundo de los demonios, pero me traicionaron y caí al mundo humano.

source: I see. where?
es_419: ah. ¿y a dónde irán?

source: wouldn't you feel so miserable? being unemployed alone is sad enough...!
es_419: ¿no te sentirías un miserable? ¡ya bastante tienes siendo desempleado!

source: I'm totally fine.
es_419: ya estoy perfecta.

source: mr. gam!
es_419: ¡señor gam!

source: this wasn't expected.
es_419: no me lo esperaba.

source: but so what? what’s the point? mr. gam...
es_419: ¿y? ¿qué sentido tiene? el señor gam…

source: I will.
es_419: claro.

source: yawn
es_419: BOSTEZA

source: what is it...?
es_419: ¿qué cosa?

source: I can’t help you with that.
es_419: no puedo ayudarte con eso.

source: is that why I'm so hungry...?
es_419: ¿por eso tendré tanta hambre?

source: this is the card for the entrance. you'll need it when I'm not here.
es_419: esta es la tarjeta para entrar. la necesitarás cuando yo no esté.

source: and I can’t stand back and let him do whatever he wants.
es_419: no puedo quedarme de brazos cruzados y dejar que haga lo que quiera.

source: I guess there is one thing.
es_419: creo que hay una cosa.

source: don't you think mr. gam looks a little different today?
es_419: ¿no crees que el señor gam se ve diferente hoy?

source: no way...
es_419: ¡no es cierto!

source: Chapter 29 Written by MJ Art by Baeklee
es_419: Episodio 29 Historia: MJ Arte: Baeklee

source: why her, of all people?
es_419: ¿por qué justo ella?

source: by the way...
es_419: por cierto,

source: why? is there a problem with the contract? would you like to amend it?
es_419: ¿por qué? ¿algún problema con el contrato? ¿quieres enmendar alguna parte?

source: don’t tell me... were you forced to drink?
es_419: no me digas que… ¿te obligaron a beber?

source: whew
es_419: FIU

source: can you try that thing you did to remove the white thread? just like what you did before. just in case.
es_419: ¿puede intentar quitarme los hilos blancos? es decir, lo mismo que hizo con ese títere. por las dudas.

source: I also saw you saying go to sleep at the bus stop just now.
es_419: también lo vi recién en la parada del autobús diciendo “duerme”.

source: don’t even think about coming near this woman.
es_419: ni se te ocurra acercarte a ella.

source: Chapter 2 Written by MJ Art by Baeklee
es_419: Episodio 2 Historia: MJ Arte: Baeklee

source: no, it’s not. what about you, miss seohwa? why aren’t you in bed yet?
es_419: no. ¿y tú qué haces aquí, seohwa? ¿por qué no te acostaste aún?

source: I understand.
es_419: lo entiendo.

source: yourself?
es_419: ¿usted?

source: insomnia is caused by imbalances in the body. you'll be able to get some great sleep after this.
es_419: el insomnio se debe a desequilibrios en el cuerpo. podrán dormir de maravilla después de la clase.

source: oh, you can just do that like so.
es_419: ah, es fácil, solo tienes que elegir esta opción.

source: you said it's your first time doing couple's yoga. working out helps with sleep.
es_419: dijo que es la primera vez que hace yoga en pareja. hacer ejercicio facilita el sueño.

source: by the way, do you like visiting lots of different places when you travel?
es_419: por cierto, ¿le gusta visitar muchos lugares cuando viaja?

source: vwoom
es_419: FRUUUM

source: so he still sacrifices himself for these measly humans.
es_419: todavía se sacrifica por esos miserables humanos.

source: I don’t know why you’re saying that...
es_419: no sé por qué dices eso, pero…

source: how am I supposed to process this?!
es_419: ¡¿cómo debería procesar esto?!

source: wake up, seohwa lee! what's wrong with you?!
es_419: ¡despierta, seohwa lee! ¡¿te volviste loca?!

source: just in case something inappropriate happens.
es_419: por si llegara a ocurrir algo inapropiado.

source: look, I'm not a senior in highschool prepping for college!
es_419: ¡no soy una adolescente preparándose para la universidad!

source: besides, that might not be a memory.
es_419: además, quizás no sea un recuerdo.

source: bedtime is midnight.
es_419: ve a dormir a la medianoche.

source: earlier
es_419: más temprano

source: foot of the mountain
es_419: pie de la montaña

source: the sand in the hourglass flows only when you sleep.
es_419: la arena del reloj solo baja mientras duermes.

source: I think you're mistaken... we're really not like that.
es_419: está equivocado. no somos pareja.

source: he must’ve also helped the weak and powerless there.
es_419: supongo que habrá ayudado a los más débiles e indefensos allá también.

source: sometimes, it feels like it's keeping me company... in place of my mom and dad...
es_419: a veces, siento que me hace compañía… en lugar de mi mamá y mi papá.

source: you need to try to remain calm and avoid stressful situations.
es_419: debe mantenerse calmada y evitar situaciones estresantes.

source: I'm gonna fall!
es_419: ¡me voy a caer!

source: ha
es_419: JA

source: you always look good, no matter what you’re wearing.
es_419: no importa lo que se ponga, siempre luce elegante.

source: I’m just confused because I haven’t dated in a while.
es_419: solo estoy confundida porque hace mucho que no salgo con nadie.

source: but since I haven't been able to sleep, I'm starting to think that I might not be your true human partner...
es_419: pero, como no he podido dormir, empiezo a preguntarme si realmente soy su compañera humana.

source: a long long time ago, there was a mystical entity who was inseparable from human beings.
es_419: hace mucho tiempo, hubo un ente místico que no se separaba de los seres humanos.

source: I’m fine. my head doesn’t hurt as much and I don’t feel nauseous anymore.
es_419: estoy bien. ya no me duele tanto la cabeza y ya no tengo más náuseas.

source: I got in trouble for a mistake I made yesterday.
es_419: me metí en problemas por un error que cometí ayer.

source: he even goes so far as to make honey tea for me...
es_419: hasta se molesta en prepararme un té con miel.

source: it looks like I should work on my manners.
es_419: parece que debo mejorar mis modales.

source: His strength was the only reason he was able to endure.
es_419: su fortaleza es lo que le permitió soportarlo.

source: I don't think that’s necessary...
es_419: no creo que sea necesario.

source: I should go to sleep.
es_419: debo ir a dormir.

source: please do not make any more absurd requests.
es_419: no me haga más propuestas indecentes.

source: I also went through a long period of unemployment.
es_419: yo también pasé mucho tiempo desempleada.

source: come to think of it, I never really liked this human. he’s always got that vacant smile on his face, like an untrained puppy.
es_419: ahora que lo pienso, nunca me agradó este humano. siempre con esa sonrisa vacía; parece un cachorro mal adiestrado.

source: I’m not the kind of person who dwells on the past.
es_419: no soy alguien que vive atado al pasado.
